IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/UsbCdcAcmDemoCpp/src/main.cpp
/**
 *
 *
 @author: Thinh Tran
 @date: May 10, 2022

 * Copyright (c) 2017 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
//#include <stdint.h>
//#include <stdbool.h>
//#include <stddef.h>
//#include <stdio.h>

#include "nrf.h"
#include "nrf_drv_usbd.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_power.h"
//#include "nrf_gpio.h"
//#include "nrf_delay.h"

#include "app_error.h"
#include "app_util.h"
#include "app_usbd_core.h"
#include "app_usbd.h"
#include "app_usbd_string_desc.h"
#include "app_usbd_cdc_acm.h"
#include "app_usbd_serial_num.h"
//#include "app_usbd_cdc_acm_internal.h"
//#include "app_usbd_class_base.h"

// IOsonata's UART, PinCfg
#include "board.h"
#include "blueio_board.h"
//#include "blueio_types.h"
#include "coredev/iopincfg.h"
#include "coredev/uart.h"
#include "iopinctrl.h"
#include "idelay.h"

#include "istddef.h"
#include "stddev.h"
#include "idelay.h"

// BLE
#include "app_util_platform.h"
#include "app_scheduler.h"
#include "ble_gap.h"
#include "ble_advdata.h"
#include "nrf_ble_scan.h"
#include "ble_app.h"
#include "ble_service.h"
#include "bluetooth/blueio_blesrvc.h"
#include "ble_dev.h"
#include "ble_gattc.h"

/**
 * @brief CLI interface over UART
 */
//NRF_CLI_UART_DEF(m_cli_uart_transport, 0, 64, 16);
//NRF_CLI_DEF(m_cli_uart,
//            "uart_cli:~$ ",
//            &m_cli_uart_transport.transport,
//            '\r',
//            4);

/**@file
 * @defgroup usbd_cdc_acm_example main.c
 * @{
 * @ingroup usbd_cdc_acm_example
 * @brief USBD CDC ACM example
 *
 */

#define DEVICE_NAME             "BleCentral"                    /**< Name of device. Will be included in the advertising data. */

//#define MANUFACTURER_NAME       "I-SYST inc."                    /**< Manufacturer. Will be passed to Device Information Service. */
//#define MODEL_NAME              "IMM-NRF5x"                      /**< Model number. Will be passed to Device Information Service. */
//#define MANUFACTURER_ID         ISYST_BLUETOOTH_ID               /**< Manufacturer ID, part of System ID. Will be passed to Device Information Service. */
//#define ORG_UNIQUE_ID           ISYST_BLUETOOTH_ID               /**< Organizational Unique ID, part of System ID. Will be passed to Device Information Service. */
//
//#define MIN_CONN_INTERVAL       MSEC_TO_UNITS(10, UNIT_1_25_MS)  /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
//#define MAX_CONN_INTERVAL       MSEC_TO_UNITS(40, UNIT_1_25_MS)  /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
//
#define SCAN_INTERVAL           MSEC_TO_UNITS(1000, UNIT_0_625_MS)		/**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             MSEC_TO_UNITS(100, UNIT_0_625_MS)       /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_TIMEOUT            0                                 		/**< Timout when scanning. 0x0000 disables timeout. */
//
//// UART
//#define PACKET_SIZE				128 //bytes
//#define UART_MAX_DATA_LEN  		(PACKET_SIZE*8)
//#define UARTFIFOSIZE			CFIFO_MEMSIZE(UART_MAX_DATA_LEN)
//
//// BLE
//#define BLE_MTU_SIZE			(PACKET_SIZE)

/**
 * @brief Enable power USB detection
 *
 * Configure if example supports USB port connection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif

#define READ_SIZE (PACKET_SIZE / 2)//1

///////////////////////////////////////////////////

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst, app_usbd_cdc_acm_user_event_t event);
static void usbd_user_ev_handler(app_usbd_event_type_t event);

void HardwareInit();
int nRFUartEvthandler(UARTDev_t *pDev, UART_EVT EvtId, uint8_t *pBuffer, int BufferLen);
void UartRxSchedHandler(void * p_event_data, uint16_t event_size);

void BleAppInitUserData();
void BleDevDiscovered(BLEPERIPH_DEV *pDev);
void BleCentralEvtUserHandler(ble_evt_t * p_ble_evt);

void UsbInit();
void UsbRxSchedHandler(void * p_event_data, uint16_t event_size);


/************************************************************
 * USBD CDC ACM section
 ************************************************************/
#define CDC_ACM_COMM_INTERFACE  0
#define CDC_ACM_COMM_EPIN       NRF_DRV_USBD_EPIN2

