IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/UsbCdcAcmDemoCpp/src/main.cpp
uint8_t g_ScanBuff[BLE_GAP_SCAN_BUFFER_EXTENDED_MAX];

ble_data_t g_AdvScanReportData = {
	.p_data = g_ScanBuff,
	.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MAX
};

static ble_gap_conn_params_t s_ConnParams = {
	.min_conn_interval = (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_MIN_CONNECTION_INTERVAL, UNIT_1_25_MS),
	.max_conn_interval = (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_MAX_CONNECTION_INTERVAL, UNIT_1_25_MS),
	.slave_latency = (uint16_t)NRF_BLE_SCAN_SLAVE_LATENCY,
	.conn_sup_timeout = (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_SUPERVISION_TIMEOUT, UNIT_10_MS),
};


//BLE_UUID_TYPE_BLE
const ble_uuid_t s_UartBleSrvAdvUuid = {
	.uuid = BLUEIO_UUID_UART_SERVICE,
	.type = BLE_UUID_TYPE_BLE,
};

BleAppScanCfg_t s_bleScanInitCfg = {
		.Interval = SCAN_INTERVAL,
		.Duration = SCAN_WINDOW,
		.Timeout = SCAN_TIMEOUT,
		.BaseUid = BLUEIO_UUID_BASE,
		.ServUid = s_UartBleSrvAdvUuid,
};

BLEPERIPH_DEV g_ConnectedDev = {
	.ConnHdl = BLE_CONN_HANDLE_INVALID,
};

uint16_t g_BleTxCharHdl = BLE_CONN_HANDLE_INVALID;
uint16_t g_BleRxCharHdl = BLE_CONN_HANDLE_INVALID;

void BleDevDiscovered(BLEPERIPH_DEV *pDev)
{
	g_Uart.printf("Number service discovered: %d\r\n", g_ConnectedDev.NbSrvc);
    for (int i = 0; i < pDev->NbSrvc; i++)
    {
    	g_Uart.printf("Service_ID %d: 0x%x,  Num_Characteristic : %d\r\n",
    			i, g_ConnectedDev.Services[i].srv_uuid.uuid, g_ConnectedDev.Services[i].char_count);
    	for (int j = 0; j < g_ConnectedDev.Services[i].char_count; j++)
    	{
    		g_Uart.printf("	Char_ID %d: 0x%x\r\n",
    				j, g_ConnectedDev.Services[i].charateristics[j].characteristic.uuid.uuid);
    	}
    }

    // Find the desired UART-BLE Service
    g_Uart.printf("Looking for UART Service with UUID = 0x%x ...", BLUEIO_UUID_UART_SERVICE);
    int idx = BleDevFindService(pDev, BLUEIO_UUID_UART_SERVICE);

    if (idx != -1)
    {
    	g_Uart.printf("Found!\r\n");
    	// Rx characteristic
    	int dcharidx = BleDevFindCharacteristic(pDev, idx, BLUEIO_UUID_UART_RX_CHAR);
    	g_Uart.printf("Find UART_RX_CHAR idx = 0x%x (%d)...", idx, idx);
    	if (dcharidx >= 0 && pDev->Services[idx].charateristics[dcharidx].characteristic.char_props.notify)
    	{
    		// Enable Notify
        	//g_Uart.printf("Enable notify\r\n");
        	BleAppEnableNotify(pDev->ConnHdl, pDev->Services[idx].charateristics[dcharidx].cccd_handle);
        	g_BleRxCharHdl = pDev->Services[idx].charateristics[dcharidx].characteristic.handle_value;
        	g_Uart.printf("Found!\r\n");
    	}
    	else
		{
			g_Uart.printf("Not Found!\r\n");
		}

    	// Tx characteristic
    	dcharidx = BleDevFindCharacteristic(pDev, idx, BLUEIO_UUID_UART_TX_CHAR);
    	g_Uart.printf("Find UART_TX_CHAR idx = 0x%x (%d) ...", idx, idx);
    	if (dcharidx >= 0)
    	{
    		g_BleTxCharHdl = pDev->Services[idx].charateristics[dcharidx].characteristic.handle_value;
    		g_Uart.printf("Found!\r\n");
    	}
    	else
    	{
    		g_Uart.printf("Not Found!\r\n");
    	}
    }
    else
    {
    	g_Uart.printf("Not Found!\r\n");
    }

}

void BleCentralEvtUserHandler(ble_evt_t * p_ble_evt)
{
    ret_code_t err_code;
    const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;
    const ble_common_evt_t *p_common_evt = &p_ble_evt->evt.common_evt;
    const ble_gattc_evt_t *p_gattc_evt = &p_ble_evt->evt.gattc_evt;
    uint8_t addr[6] = { 0xda, 0x02, 0xe8, 0xfe, 0xac, 0xd1};

    switch (p_ble_evt->header.evt_id)
    {
    	case BLE_GAP_EVT_CONNECTED:
    		{
				g_ConnectedDev.ConnHdl = p_gap_evt->conn_handle;
				err_code = BleAppDiscoverDevice(&g_ConnectedDev);
    		}
    		break;
        case BLE_GAP_EVT_ADV_REPORT:
			{
				// Scan data report
				const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;

				// Find device by name
				if (ble_advdata_name_find(p_adv_report->data.p_data, p_adv_report->data.len, "UartBleBridge"))
	//            if (memcmp(addr, p_adv_report->peer_addr.addr, 6) == 0)
				{
					err_code = BleAppConnect((ble_gap_addr_t *)&p_adv_report->peer_addr, &s_ConnParams);
					msDelay(100);
				}
				else
				{
					BleAppScan();
				}
			}
			break;
        case BLE_GAP_EVT_TIMEOUT:
        	{
        	    ble_gap_evt_timeout_t const * p_timeout = &p_gap_evt->params.timeout;
        	    if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
        	    {
        	    	// Scan timeout
        	    }
        	}
        	break;
        case BLE_GAP_EVT_SCAN_REQ_REPORT:
        	{
        	    ble_gap_evt_scan_req_report_t const * p_req_report = &p_gap_evt->params.scan_req_report;
        	}
        	break;
        case BLE_GATTC_EVT_HVX:
        	IOPinToggle(LED_RED_PORT, LED_RED_PIN);
        	if (p_ble_evt->evt.gattc_evt.params.hvx.handle == g_BleRxCharHdl)
        	{
        		//uint16_t lenTx = p_ble_evt->evt.gattc_evt.params.hvx.len;
        		//memcpy(&g_UsbTxBuff, &p_ble_evt->evt.gattc_evt.params.hvx.data, lenTx);
        		//app_usbd_cdc_acm_write(&m_app_cdc_acm, g_UsbTxBuff, lenTx);
        		g_Uart.Tx(p_ble_evt->evt.gattc_evt.params.hvx.data,
        				p_ble_evt->evt.gattc_evt.params.hvx.len);

        		app_usbd_cdc_acm_write(&m_app_cdc_acm,
        				&p_ble_evt->evt.gattc_evt.params.hvx.data,
						p_ble_evt->evt.gattc_evt.params.hvx.len);
        	}
        	IOPinToggle(LED_RED_PORT, LED_RED_PIN);
        	break;
  }
}


/********************************************************************************/
//static uint8_t g_extern_usbd_product_string[] = APP_USBD_STRING_DESC("Test");
//static uint8_t g_extern_usbd_serial_number[] = { "12345" };
/**
 * @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t (headphones)
 * */
static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_cdc_acm_user_event_t event)
{
    app_usbd_cdc_acm_t const * p_cdc_acm = app_usbd_cdc_acm_class_get(p_inst);
    //static uint16_t dataLen;

    switch (event)
    {
        case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN:
        {
        	IOPinSet(LED_GREEN_PORT, LED_GREEN_PIN);
            /*Setup first transfer*/
            ret_code_t ret = app_usbd_cdc_acm_read_any(&m_app_cdc_acm,
                                                   g_UsbRxBuff,
                                                   READ_SIZE);
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
        	IOPinClear(LED_GREEN_PORT, LED_GREEN_PIN);
            break;
        case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
        {
        	IOPinToggle(LED_GREEN_PORT, LED_GREEN_PIN);
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_RX_DONE:
        {
        	IOPinToggle(LED_GREEN_PORT, LED_GREEN_PIN);
//        	// Retrieve USB Rx buffer
//			g_UsbRxBuffLen = app_usbd_cdc_acm_rx_size(p_cdc_acm);
//			app_usbd_cdc_acm_read_any(p_cdc_acm, g_UsbRxBuff, PACKET_SIZE);

			// Schedule the handler for this event
        	app_sched_event_put(NULL, 0, UsbRxSchedHandler);
            IOPinToggle(LED_GREEN_PORT, LED_GREEN_PIN);
            break;
        }
        default:
            break;
    }
}


void UsbRxSchedHandler(void * p_event_data, uint16_t event_size)
{

	// Retrieve USB Rx buffer
	g_UsbRxBuffLen = app_usbd_cdc_acm_rx_size(&m_app_cdc_acm);
	app_usbd_cdc_acm_read_any(&m_app_cdc_acm, g_UsbRxBuff, PACKET_SIZE);

	uint8_t buff[PACKET_SIZE];
	memcpy(buff, g_UsbRxBuff, g_UsbRxBuffLen);

	// Send to Uart
	if (g_UsbRxBuffLen > 0)
	{
		g_Uart.Tx(buff, g_UsbRxBuffLen);
	}

	// Send to BLE
	if (g_UsbRxBuffLen > 0)
	{
		if (g_ConnectedDev.ConnHdl != BLE_CONN_HANDLE_INVALID && g_BleTxCharHdl != BLE_CONN_HANDLE_INVALID)
		{
			BleAppWrite(g_ConnectedDev.ConnHdl, g_BleTxCharHdl, buff, g_UsbRxBuffLen);
		}
	}
}


static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event)
    {
        case APP_USBD_EVT_DRV_SUSPEND:
//        	g_Uart.printf("APP_USBD_EVT_DRV_SUSPEND\r\n");
        	IOPinClear(LED_RED_PORT, LED_RED_PIN);
            break;
        case APP_USBD_EVT_DRV_RESUME:
//        	g_Uart.printf("APP_USBD_EVT_DRV_RESUME\r\n");
        	IOPinSet(LED_RED_PORT, LED_RED_PIN);
            break;
        case APP_USBD_EVT_STARTED:
//        	g_Uart.printf("APP_USBD_EVT_STARTED\r\n");
        	IOPinSet(LED_RED_PORT, LED_RED_PIN);
            break;
        case APP_USBD_EVT_STOPPED:
//        	g_Uart.printf("APP_USBD_EVT_STOPPED\r\n");
            app_usbd_disable();
            IOPinSet(LED_RED_PORT, LED_RED_PIN);
            IOPinSet(LED_GREEN_PORT, LED_GREEN_PIN);
            IOPinSet(LED_BLUE_PORT, LED_BLUE_PIN);
            break;
        case APP_USBD_EVT_POWER_DETECTED:
//        	g_Uart.printf("APP_USBD_EVT_POWER_DETECTED\r\n");
            if (!nrf_drv_usbd_is_enabled())
            {
                app_usbd_enable();
            }
            IOPinToggle(LED_RED_PORT, LED_RED_PIN);
            msDelay(250);
            IOPinToggle(LED_RED_PORT, LED_RED_PIN);
            break;
        case APP_USBD_EVT_POWER_REMOVED:
//        	g_Uart.printf("APP_USBD_EVT_POWER_REMOVED\r\n");
            app_usbd_stop();
            IOPinClear(LED_RED_PORT, LED_RED_PIN);
            break;
        case APP_USBD_EVT_POWER_READY:
//        	g_Uart.printf("APP_USBD_EVT_POWER_READY\r\n");
            app_usbd_start();
            IOPinSet(LED_RED_PORT, LED_RED_PIN);
            break;
        default:
            break;
    }
}


