IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/UsbCdcAcmDemoCpp/src/main.cpp
void HardwareInit()
{
    /* TODO: Hardware init
     * LEDs
     * UART
     * Timer
     */

	// Clock
	ret_code_t ret;
	ret = nrf_drv_clock_init();

	// Uart
	g_Uart.Init(g_UartCfg);
	g_Uart.printf("Clock init...%s\r\n", (ret ? "Failed!" : "Done!"));
	g_Uart.printf("UART Configuration: %d, %d, %d\r\n",
			g_UartCfg.Rate, g_UartCfg.FlowControl, g_UartCfg.Parity);
	msDelay(100);

	// LEDs
	IOPinCfg(s_Leds, s_NbLeds);
	IOPinSet(LED_BLUE_PORT, LED_BLUE_PIN);
	IOPinClear(LED_RED_PORT, LED_RED_PIN);
	IOPinClear(LED_GREEN_PORT, LED_GREEN_PIN);

}

void UsbInit()
{
	ret_code_t ret;

	// Init USB
	g_Uart.printf("Init USB...");
	ret = app_usbd_init(&usbd_config);
	g_Uart.printf("%s\r\n", (ret ? "Failed" : "Done!"));

	//USBD serial number generator
	app_usbd_serial_num_generate();

	// Append USB class instance
	g_Uart.printf("USBD class append...");
	const app_usbd_class_inst_t *class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
	ret = app_usbd_class_append(class_cdc_acm);
	g_Uart.printf("%s\r\n", (ret ? "Failed" : "Done!"));

	// Check power
	if (USBD_POWER_DETECTION)
	{
		g_Uart.printf("USB power detection...");
		ret = app_usbd_power_events_enable();
		//msDelay(250);
		//APP_ERROR_CHECK(ret);
		g_Uart.printf("%s\r\n", (ret ? "Failed" : "Done!"));
	}
	else
	{
		g_Uart.printf("No USB power detection enabled\r\nStarting USB now");
		app_usbd_enable();
		app_usbd_start();
	}
}

void BleAppInitUserData()
{
	// TODO: Add passkey pairing
/*	ble_opt_t opt;
	opt.gap_opt.passkey.p_passkey = (uint8_t*)"123456";
	uint32_t err_code =  sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &opt);
	APP_ERROR_CHECK(err_code);*/
}

void UartRxSchedHandler(void * p_event_data, uint16_t event_size)
{
	uint8_t buff[PACKET_SIZE];

	int l = g_Uart.Rx(buff, PACKET_SIZE);
	if (l > 0)
	{
		if (g_ConnectedDev.ConnHdl != BLE_CONN_HANDLE_INVALID && g_BleTxCharHdl != BLE_CONN_HANDLE_INVALID)
		{
			BleAppWrite(g_ConnectedDev.ConnHdl, g_BleTxCharHdl, buff, l);
		}
	}
}

int nRFUartEvthandler(UARTDev_t *pDev, UART_EVT EvtId, uint8_t *pBuffer, int BufferLen)
{
	int cnt = 0;
//	uint8_t buff[20];

	switch (EvtId)
	{
		case UART_EVT_RXTIMEOUT:
		case UART_EVT_RXDATA:
			app_sched_event_put(NULL, 0, UartRxSchedHandler);
			break;
		case UART_EVT_TXREADY:
			break;
		case UART_EVT_LINESTATE:
			break;
	}

	return cnt;
}


int main(void)
{
	ret_code_t ret;

	HardwareInit();

    UsbInit();// Should be called before BLE initialization
    g_Uart.printf("USB CDC ACM is on\r\n");
    msDelay(500);

    // BLE
    g_Uart.printf("Init BLE...");
    BleAppInit((const BLEAPP_CFG *)&s_BleAppCfg, true);
    g_Uart.printf("Done!\r\n");
    msDelay(250);

    g_Uart.printf("All initializations are done. Start the main tasks!\r\n");
    // Register the non-GATT BLE services and their characteristics
	BleAppScanInit((BleAppScanCfg_t *)&s_bleScanInitCfg);
	BleAppScan();
	BleAppRun();

	return 0;
}
